public/reading/economics/itermediate-micro-economics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../reading.html">Reading</a> &gt; <a href="economics.html">Economics</a> &gt;
</p>
<div id="outline-container-org571f698" class="outline-2">
<h2 id="org571f698">Itermediate Micro Economics - Hal. R. Varian</h2>
<div class="outline-text-2" id="text-org571f698">
</div>
</div>
<div id="outline-container-org4808372" class="outline-2">
<h2 id="org4808372">Chapter 1: The Market</h2>
<div class="outline-text-2" id="text-org4808372">
</div>
<div id="outline-container-org965d8ab" class="outline-3">
<h3 id="org965d8ab">Models</h3>
<div class="outline-text-3" id="text-org965d8ab">
<p>
Economics proceeds by developing <b>models</b> of social phenomena, which
are a simplified representation of reality.
</p>

<p>
For example, let use consider the market for apartments in a
medium-size mid-western college town. We may suppose that the
apartments closer to the university are more desired since people have
to walk less to go to the university, we will only consider this
distance in out model, up to a maximum distance.
</p>
</div>
</div>
<div id="outline-container-org68b31f0" class="outline-3">
<h3 id="org68b31f0">Exogenous and endogenous variables</h3>
<div class="outline-text-3" id="text-org68b31f0">
<p>
Our model does not cover the apartments outside of this distance or
ring, and we say that their price is an <b>exogenous variable</b>, while
the price of the closer apartments is an <b>endogenous variable</b>.
</p>
</div>
</div>
<div id="outline-container-org5e57c84" class="outline-3">
<h3 id="org5e57c84">Optimization and equilibrium principle</h3>
<div class="outline-text-3" id="text-org5e57c84">
<p>
Whenever we try to explain the behavior of human being we need to
have a framework on which our analysis can be based. We will follow
two simple principles:
</p>

<ul class="org-ul">
<li><b>the optimization principle</b>: people try to choose the best
patterns of consumption that they can afford</li>
<li><b>the equilibrium principle</b>: prices adjust until the amount that
people demand of something is equal to the amount that is supplied.</li>
</ul>

<p>
The first principle is almost a tautology, indeed it seems
unreasonable that people would not try to get things that they don't
want. The second is a bit more problematic, it may happen that supply
and demand are not compatible, but for most cases they are. For
example, the price of apartments is fairly stable over a short
time-frame. We will ignore long time frames in this initial analysis.
</p>
</div>
</div>
<div id="outline-container-org736aed8" class="outline-3">
<h3 id="org736aed8">Reservation price</h3>
<div class="outline-text-3" id="text-org736aed8">
<p>
We call the <b>reservation price</b> a person's maximum willingness to
pay for something. It is the highest price that a given person will
accept and still purchase the good.
</p>

<p>
In our example, the number of apartments that will be rented at a
given price \(p^*\) will just be the number of people who have a
reservation price greater than or equal to \(p^*\). For if the market
price is \(p^*\), then everyone who is willing to pay at lest \(p^*\) for
an apartment will want an apartment in the inner ring, and everyone
who is not willing to pay \(p^*\) will choose to live in the outer ring.
</p>
</div>
</div>
<div id="outline-container-org9c9a45b" class="outline-3">
<h3 id="org9c9a45b">The demand curve</h3>
<div class="outline-text-3" id="text-org9c9a45b">
<p>
The <b>demand curve</b> is a plot showing the price and the number of
people who are willing to pay that price or more. Since data is
discrete, that would be the best curve that fits the data.
</p>
</div>
</div>
<div id="outline-container-org2c78940" class="outline-3">
<h3 id="org2c78940">Competitive market</h3>
<div class="outline-text-3" id="text-org2c78940">
<p>
We refer to a <b>competitive market</b> the situation where there are
many independent landlords who are each out to rent their apartments
for the highest price the market will bear.
</p>
</div>
</div>
<div id="outline-container-org2062ad6" class="outline-3">
<h3 id="org2062ad6">The supply curve</h3>
<div class="outline-text-3" id="text-org2062ad6">
<p>
Let us now consider the case where there are many landlords who all
operate independently. If all landlords are trying to do the best they
can and if the renters are fully informed about the prices the
landlords charge, then the equilibrium price of all apartments in the
inner ring must be the same. The argument is not difficult. Suppose
instead that there is some high price \(p_h\) and some low price \(p_l\)
being charged for apartments. The people who are renting their
apartments for a high price could go to a landlord renting for a low
price and offer to pay a rent somewhere between \(p_h\) and \(p_l\).
A transaction at such a price would make both the renter and the
landlord better off. To the extent that all parties are seeking to
further their own interests and are aware of the alternative prices
being charged, a situation with different prices being charged for the
same good cannot persist in equilibrium.
</p>

<p>
In out case, considering a short timeframe that does not account for
new houses being built, the <b>supply curve</b> would be a vertical
line. Whatever price is being charged, the same number of apartments
will be rented.
</p>
</div>
</div>
<div id="outline-container-orgea38a72" class="outline-3">
<h3 id="orgea38a72">Market equilibrium</h3>
<div class="outline-text-3" id="text-orgea38a72">
<p>
We refer to the <b>equilibrium price</b> \(p^*\) as the price where the
quantity of apartments demanded equals the quantity supplied. At this
price, each consumer who is willing to pay at least \(p^*\) is able to
find an apartment to rent, and each landlord will be able to rent
apartments at the going market price. Neither the consumers nor the
landlords have any readon to change their behaviour, hence the term
<span class="underline">equilibrium</span>.
</p>
</div>
</div>
<div id="outline-container-org3e75050" class="outline-3">
<h3 id="org3e75050">Comparative statics</h3>
<div class="outline-text-3" id="text-org3e75050">
<p>
<b>Comparative statics</b> is the study of the behaviour of the equilibrium
price when various aspects of the market change. Here we study only
the change from one equilibra to another, hence the term <span class="underline">static</span>, we
do not consider how that movement takes place for now.
</p>

<p>
As an exercise, suppose that a developer decides to turn several of
the apartments into condominiums, what will happen to the price of the
remaining apartments? If we suppose that the people who where renting
the apartments will buy them, then the demand for apartments will have
been reduces as much as the supply, so the equilibrium price remains
unchanged.
</p>

<p>
Let's consider another example, where the city council decides that
there should be a tax on apartments of 50 dollars a year, what will
this do to the price of apartments? We observe that the supply curve
doesn't change as there are just as many apartments after the tax as
before the tax, and the demand curve doesn't change either, therefore
the price does not change as a result of the tax. In essence, the the
demand does not change, the landlords cannot raise the price to
compensate for the tax, or not enough people would afford to occuply
the apartments and the landlords will not be able to get the rented
price. Note that we are assuming that the supply of apartments remains
fixed.
</p>
</div>
</div>
<div id="outline-container-org4a9eae7" class="outline-3">
<h3 id="org4a9eae7">Other ways to allocate apartments</h3>
<div class="outline-text-3" id="text-org4a9eae7">
<p>
So far we have assumed a competitive market. This is not the only type
of markets, here are other ways:
</p>

<ul class="org-ul">
<li><b>the discriminating monopolist</b>: here we consider a situation where
there is only one dominant landlord who own all of the apartments
(or a number of individual landlords cooperating) also known as a
<b>monopoly</b>. Suppose the landlord could decide to auction them off
one by one to the highest bidders, in this situation exactly the
same people will get the apartments as in the case of the market
solution, and the last person to rent an apartment pays the price
\(p^*\). The discriminating monopolist attempts to maximize his own
profits leading to the same allocation of apartments as a
competitive market but with different amounts paid by each person.</li>
<li><b>the ordinary monopolist</b>: what if the monopolist wwere forced to
rent all apartments at the same price?If he chooses a low price he
will rent more apartments but he may end up making less money than
if he sets a higher price. What he will do instead is not to rent
all apartments, but to rent only a fraction of them so that it
maximizes the provit from the highest bidders.</li>
<li><b>rent control</b>: let us consider the case where the city imposes a
maximum rent that can be charged for apartments \(p_{max}\). Suppose
\(p_{max} < p^*\), then we would have a situation of <b>eccess demand</b>
where there are more people who are willing to rent apartments at
\(p_{max}\). Who gets the apartment is outside the scope of the model.</li>
</ul>
</div>
</div>
<div id="outline-container-orge23fd61" class="outline-3">
<h3 id="orge23fd61">Pareto Efficiency</h3>
<div class="outline-text-3" id="text-orge23fd61">
<p>
To compare different economics institutions, we introduce the <b>Pareto
efficiency</b> which is defined in the following way: if we can find a
way to make some people better off without making anybody else worse
off, we have a <b>Pareto improvement</b>. If an allocation allows a Pareto
improvement, it is called <b>Pareto inefficient</b>; if an allocation is
such that no Pareto improvements are possible, it is called <b>Pareto
efficient</b>. The idea is that, if there is a way to make someone better
off without hurting anyone else, why not do it?
</p>
</div>
</div>
</div>
<div id="outline-container-orge2fc55a" class="outline-2">
<h2 id="orge2fc55a">Chapter 2: Budget Constraint</h2>
<div class="outline-text-2" id="text-orge2fc55a">
<p>
In this chapter, we will examine how to describe what a consumer can
afford.
</p>
</div>
<div id="outline-container-org6625969" class="outline-3">
<h3 id="org6625969">The budget constraint</h3>
<div class="outline-text-3" id="text-org6625969">
<p>
We define a <b>consumption budle</b> \((x_1, x_2)\) as a pair representing
how much the consumer is choosing to consume of good \(1\), \(x_1\), and
how much the consumer is choosing to consume of good \(2\), \(x_2\). We
suppose that we can observe the prices of the two goods \((p_1, p_2)\)
and the amount of money the consumer has to spend \(m\)
</p>

<p>
Then, a <b>budget constraint</b> is:
</p>

<p>
\[
p_1 x_1 + p_2 x_2 \le m
\]
</p>

<p>
where \(p_1 x_1\) is the amount of money the consumer is spending on
good \(1\), and \(p_2x_2\) for good \(2\).
</p>

<p>
The consumption bundle may be generalized as such. If we are
interested in studying a consumer's demand for milk, we might let
\(x_1\) measure his or her consumption of milk and let \(x_2\) stand for
everything else the consumer might want to consume in dollars, so \(p_2
= 1\). The budget constraint would then look like:
</p>

<p>
\[p_1x_1 + x_2 \le m\]
</p>

<p>
which is a special case of the original budget constraint, so
everything that applies in the general case also applies here.
</p>
</div>
</div>
<div id="outline-container-orgef363c8" class="outline-3">
<h3 id="orgef363c8">Budget line</h3>
<div class="outline-text-3" id="text-orgef363c8">
<p>
The <b>budget line</b> is the set of bundles that cost exactly \(m\):
</p>

<p>
\[p_1x_1 + p_2x_2 = m\]
</p>

<p>
These are the bundles of goods that just exhaust the consumer's
income, which is a line. We say that the derivative of the line is the
<b>opportunity cost</b> of consuming good \(1\). In order to consume more of
good \(1\) you have to give up some consumption of good \(2\) which is
measured by the slope of the budget line.
</p>

<hr />

<p>
Travel: <a href="economics.html">Economics</a>, <a href="../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
